{
  "_attn_implementation_autoset": true,
  "_name_or_path": "gravitee-io/bert-small-pii-detection",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 512,
  "id2label": {
    "0": "O",
    "1": "B-AGE",
    "2": "I-AGE",
    "3": "B-COORDINATE",
    "4": "I-COORDINATE",
    "5": "B-CREDIT_CARD",
    "6": "I-CREDIT_CARD",
    "7": "B-DATE_TIME",
    "8": "I-DATE_TIME",
    "9": "B-EMAIL_ADDRESS",
    "10": "I-EMAIL_ADDRESS",
    "11": "B-FINANCIAL",
    "12": "I-FINANCIAL",
    "13": "B-IBAN_CODE",
    "14": "I-IBAN_CODE",
    "15": "B-IMEI",
    "16": "I-IMEI",
    "17": "B-IP_ADDRESS",
    "18": "I-IP_ADDRESS",
    "19": "B-LOCATION",
    "20": "I-LOCATION",
    "21": "B-MAC_ADDRESS",
    "22": "I-MAC_ADDRESS",
    "23": "B-NRP",
    "24": "I-NRP",
    "25": "B-ORGANIZATION",
    "26": "I-ORGANIZATION",
    "27": "B-PASSWORD",
    "28": "I-PASSWORD",
    "29": "B-PERSON",
    "30": "I-PERSON",
    "31": "B-PHONE_NUMBER",
    "32": "I-PHONE_NUMBER",
    "33": "B-TITLE",
    "34": "I-TITLE",
    "35": "B-URL",
    "36": "I-URL",
    "37": "B-US_BANK_NUMBER",
    "38": "I-US_BANK_NUMBER",
    "39": "B-US_DRIVER_LICENSE",
    "40": "I-US_DRIVER_LICENSE",
    "41": "B-US_ITIN",
    "42": "I-US_ITIN",
    "43": "B-US_LICENSE_PLATE",
    "44": "I-US_LICENSE_PLATE",
    "45": "B-US_PASSPORT",
    "46": "I-US_PASSPORT",
    "47": "B-US_SSN",
    "48": "I-US_SSN"
  },
  "initializer_range": 0.02,
  "intermediate_size": 2048,
  "label2id": {
    "B-AGE": 1,
    "B-COORDINATE": 3,
    "B-CREDIT_CARD": 5,
    "B-DATE_TIME": 7,
    "B-EMAIL_ADDRESS": 9,
    "B-FINANCIAL": 11,
    "B-IBAN_CODE": 13,
    "B-IMEI": 15,
    "B-IP_ADDRESS": 17,
    "B-LOCATION": 19,
    "B-MAC_ADDRESS": 21,
    "B-NRP": 23,
    "B-ORGANIZATION": 25,
    "B-PASSWORD": 27,
    "B-PERSON": 29,
    "B-PHONE_NUMBER": 31,
    "B-TITLE": 33,
    "B-URL": 35,
    "B-US_BANK_NUMBER": 37,
    "B-US_DRIVER_LICENSE": 39,
    "B-US_ITIN": 41,
    "B-US_LICENSE_PLATE": 43,
    "B-US_PASSPORT": 45,
    "B-US_SSN": 47,
    "I-AGE": 2,
    "I-COORDINATE": 4,
    "I-CREDIT_CARD": 6,
    "I-DATE_TIME": 8,
    "I-EMAIL_ADDRESS": 10,
    "I-FINANCIAL": 12,
    "I-IBAN_CODE": 14,
    "I-IMEI": 16,
    "I-IP_ADDRESS": 18,
    "I-LOCATION": 20,
    "I-MAC_ADDRESS": 22,
    "I-NRP": 24,
    "I-ORGANIZATION": 26,
    "I-PASSWORD": 28,
    "I-PERSON": 30,
    "I-PHONE_NUMBER": 32,
    "I-TITLE": 34,
    "I-URL": 36,
    "I-US_BANK_NUMBER": 38,
    "I-US_DRIVER_LICENSE": 40,
    "I-US_ITIN": 42,
    "I-US_LICENSE_PLATE": 44,
    "I-US_PASSPORT": 46,
    "I-US_SSN": 48,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 8,
  "num_hidden_layers": 4,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.49.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
